tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "deno"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "ghq"
brew "git-lfs"
brew "go"
brew "jq"
brew "lazygit"
brew "mkcert"
brew "mysql", restart_service: true
brew "neovim"
brew "nginx"
brew "node"
brew "peco"
brew "procs"
brew "rbenv"
brew "ripgrep"
brew "terraform"
brew "z"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-monaspace"
cask "iterm2"
cask "keycastr"
cask "multipass"
cask "orbstack"
cask "raycast"
cask "unity-hub"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shopify.ruby-lsp"
vscode "tal7aouy.theme"
vscode "twxs.cmake"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscodevim.vim"
